{
	"resume": [
		{
			"title": "Sr. UX Designer",
			"business": "Freight Science",
			"duration": "2022 to Present",
			"summary": "Full spectrum designer and engineer for the Freight Science web platform, bringing multiple capabilities from idea to production with design thinking and agile development.",
			"outcomes": [
				"Built multiple product views including dashboards, multi-state forms, data visualizations, grids and tables using React, Tailwind, Visx, Chart.js, and CSS Grid.",
				"Responsible for UI design, usability testing, front end development with React and Typescript, back end development with Node and Postgres.",
				"Implemented analytics via Heap API, data management with React Query via REST API integrations.",
				"Designed and developed a universal view management system that enables users to create preset filters for various datasets. The filter system is portable across the entire app and supports any data type, able to be applied wherever said data types are used. This reduced time on task and increased app usability by removing duplicate work re-applying filters to various screens.",
				"Design and development of multiple UI components deployed via NPM package and documented using Storybook as part of global component library."
			],
			"tech": [
				{ "label": "React", "icon": "react" },
				{ "label": "TypeScript", "icon": "typescript" },
				{ "label": "Tailwind", "icon": "tailwind" },
				{ "label": "HTML", "icon": "html" },
				{ "label": "CSS", "icon": "css" },
				{ "label": "JavaScript", "icon": "javascript" },
				{ "label": "Node", "icon": "node" },
				{ "label": "Express", "icon": "express" },
				{ "label": "Postgres", "icon": "postgres" },
				{ "label": "Figma", "icon": "figma" }
			]
		},
		{
			"title": "UX Architect",
			"business": "Intrusion, Inc.",
			"duration": "2021 to 2022",
			"summary": "Front-end architect for networking cyber security product. Responsible for design and engineering of new capabilities including security dashboards, authorization workflows, data discovery tools, and user management.",
			"outcomes": [
				"Bolstered product adoption by building a new product dashboard which highlighted malicious network devices and connections using Vue, Chart.js, and amCharts.",
				"Broadened user base for on-premise network monitoring platform by adding authentication and role-based permissions with route guards.",
				"Improved code support by spearheading migration of app code from Vue 2 to Vue 3.",
				"Increased code resiliency and product trust by implementing a complete test suite using Cypress and Vitest, integrated into CI/CD pipeline on GitLab."
			],
			"tech": [
				{ "label": "Vue", "icon": "vue" },
				{ "label": "Tailwind", "icon": "tailwind" },
				{ "label": "HTML", "icon": "html" },
				{ "label": "CSS", "icon": "css" },
				{ "label": "JavaScript", "icon": "javascript" },
				{ "label": "Python", "icon": "python" },
				{ "label": "Figma", "icon": "figma" }
			]
		},
		{
			"title": "Full Stack Developer",
			"business": "World Wide Technology",
			"duration": "2020 to 2021",
			"summary": "Full stack developer working on WWT corporate website. Delivered customer facing features using Vue and Tailwind. Implemented microservices using Nodejs and MongoDB.",
			"outcomes": [
				"Built user interfaces and back-end services for the WWT corporate website which has over 30,000 monthly visitors.",
				"Full stack development for new WWT Communities feature, building UI components with Nuxt.js and micro-services with Express.js.",
				"Reduced time on task and improved edit accuracy with design and development of new live content editing feature.",
				"Contributed to WWT Vue.js component library"
			],
			"tech": [
				{ "label": "Vue", "icon": "vue" },
				{ "label": "Tailwind", "icon": "tailwind" },
				{ "label": "HTML", "icon": "html" },
				{ "label": "CSS", "icon": "css" },
				{ "label": "JavaScript", "icon": "javascript" },
				{ "label": "Node", "icon": "node" },
				{ "label": "Express", "icon": "express" },
				{ "label": "MongoDB", "icon": "mongodb" },
				{ "label": "Figma", "icon": "figma" }
			]
		},
		{
			"title": "Sr. Software Design Engineer",
			"business": "Mercy",
			"duration": "2019 to 2020",
			"summary": "Full spectrum designer and engineer for Mercy healthcare's virtual research and development team.",
			"outcomes": [
				"Improved virtual visits during COVID-19 by building a React-web-based point-to-point video chat app, supporting 2k-3k video visits per day.",
				"Reduced pediatric ER visits and improved patient quality of life by creating a patient portal using React Native that connects sick kids and their caregivers to medical staff for 24/7 support.",
				"Design and developed key features for Mercy Continuum health monitoring platform using Vue, Postgres, and Node.",
				"Moderated usability and user acceptance testing sessions to ensure product alignment with customers and stakeholders."
			],
			"tech": [
				{ "label": "React", "icon": "react" },
				{ "label": "React Native", "icon": "react" },
				{ "label": "Vue", "icon": "vue" },
				{ "label": "HTML", "icon": "html" },
				{ "label": "CSS", "icon": "css" },
				{ "label": "JavaScript", "icon": "javascript" },
				{ "label": "Node", "icon": "node" },
				{ "label": "Express", "icon": "express" },
				{ "label": "Postgres", "icon": "postgres" },
				{ "label": "Sketch", "icon": "sketch" }
			]
		},
		{
			"title": "Sr. UX Designer",
			"business": "Coolfire",
			"duration": "2018 to 2019",
			"summary": "Design and Practice lead for client-service software agency. Brought multiple customer and internal projects to life through lean user research and rapid prototyping.",
			"outcomes": [
				"Reduced costs while improving user and customer satisfaction with a new roadside assistance tool for Enterprise (the rental car folks).",
				"Improved responsiveness to threats for a private security group by designing actionable interfaces for web and mobile, streamlining situational awareness for high profile engagements.",
				"Rapidly prototyped a real-time logistics tracking and ordering platform that enabled drop shipments to resupply partners.",
				"Operated as practice lead for a growing design team and handled identity design for new SaaS products.",
				"Established the visual identity for Coolfire's back-end-as-a-service product, Ronin, and provided art direction for the new public-facing product site.",
				"Partnered with engineering to design and build a sample chat application that demonstrated all the best components of the Coolfire Ronin platform."
			],
			"tech": [
				{ "label": "Sketch", "icon": "sketch" },
				{ "label": "PhotoShop", "icon": "photoshop" },
				{ "label": "Illustrator", "icon": "illustrator" }
			]
		},
		{
			"title": "UX Designer",
			"business": "WWT Asynchrony Labs",
			"duration": "2017 to 2018",
			"summary": "UX Designer and Front-end engineer working with Angular 2, 4. Code contributor to multiple web-based client projects including a mortgage app and freight inspection tool.",
			"outcomes": [
				"Grew online mortgage application rates for a national bank by designing a conversational loan app process built with Angular 4.",
				"Improved code quality of Angular 4 application by implementing Cypress tests to validate branching mortgage logic.",
				"Rapidly prototyped multiple client projects using Sketch, HTML, and CSS."
			],
			"tech": [
				{ "label": "Angular", "icon": "angular" },
				{ "label": "HTML", "icon": "html" },
				{ "label": "CSS", "icon": "css" },
				{ "label": "JavaScript", "icon": "javascript" },
				{ "label": "Sketch", "icon": "sketch" }
			]
		},
		{
			"title": "Owner / Chief Designer",
			"business": "Bax Art & Design Co. LLC",
			"duration": "2015 to 2017",
			"summary": "Chief designer, accountant, HR, customer service, and head of sales and marketing. Made people happy by pushing pixels as a graphic designer, web designer, and 3D artist.",
			"tech": [
				{ "label": "HTML", "icon": "html" },
				{ "label": "CSS", "icon": "css" },
				{ "label": "JavaScript", "icon": "javascript" },
				{ "label": "PhotoShop", "icon": "photoshop" },
				{ "label": "Illustrator", "icon": "illustrator" }
			]
		},
		{
			"title": "Senior Designer",
			"business": "Controller Chaos",
			"duration": "2013 to 2015",
			"summary": "Lead designer and web developer for a small custom controller business.",
			"outcomes": [
				"Oversaw e-commerce platform, responsible for designing and building multiple product feature pages with HTML and CSS.",
				"Revolutionized product design pipeline by replacing traditional product photography with 3D renders and computer animation.",
				"Increased key performance metrics for e-commerce site by redesigning the product customization interface, boosting engagement, time on site, and sales.",
				"Reduced support requests related to product operation by designing attractive instructions that doubled as posters.",
				"Maintained revenue through dry seasons by developing an auxiliary brand and managing operations of that business.",
				"Trained up the next generation of designers by providing thought leadership and mentorship."
			],
			"tech": [
				{ "label": "HTML", "icon": "html" },
				{ "label": "CSS", "icon": "css" },
				{ "label": "JavaScript", "icon": "javascript" },
				{ "label": "PhotoShop", "icon": "photoshop" },
				{ "label": "Illustrator", "icon": "illustrator" }
			]
		},
		{
			"title": "Adjunct Instructor",
			"business": "ITT Technical Institute",
			"duration": "2011 to 2013",
			"summary": "Warped the minds and inspired the futures of eager students in the field of graphic design, 3D modeling, and computer animation. Gave lectures, provided life skills, and occasionally took attendance."
		}
	],
	"certifications": [
		{
			"title": "Responsive Web Design",
			"slug": "https://www.freecodecamp.org/certification/brendanbax/responsive-web-design"
		},
		{
			"title": "Front End Libraries",
			"slug": "https://www.freecodecamp.org/certification/brendanbax/front-end-libraries"
		},
		{
			"title": "JavaScript Algorithms and Data Structures",
			"slug": "https://www.freecodecamp.org/certification/brendanbax/javascript-algorithms-and-data-structures"
		},
		{
			"title": "APIs and Microservices",
			"slug": "https://www.freecodecamp.org/certification/brendanbax/apis-and-microservices"
		}
	],
	"recommendations": [
		{
			"content": "Brendan is extremely passionate about his work, creating/delivering great products, and has great insights. His experience in design thinking and elements, coding, and understanding business value delivery makes him a huge asset to any team.",
			"author": "Alex Courtney",
			"role": "Director of Innovation R&D, Mercy Virtual",
			"social": "https://www.linkedin.com/in/alexander-courtney-stl/"
		},
		{
			"content": "Working with Brendan in Mercy Virtual's R&D group was a pleasure. His programming skills were top notch and his personality, drive, and ability to understand the mission was unparalleled. Brendan's eye for design and desire to build usable, yet beautiful interfaces really stood out while we worked together. He was always eager to teach and learn and his leadership kept us on track in our agile environment. Great guy, great developer, great designer, and a pleasure to work with.",
			"author": "Jordan Woerndle",
			"role": "Developer, Mercy Virtual",
			"social": "https://www.linkedin.com/in/jordan-woerndle/"
		},
		{
			"content": "Brendan is a rare combination - a software engineer plus user-experience designer. And he is not just adequate at both, he excels.",
			"author": "Peter Granderson",
			"role": "Developer, Mercy Virtual",
			"social": ""
		},
		{
			"content": "Brendan has an infectious attitude that leaves you feeling excited to execute on the designs and concepts that he creates. He has also been a great mentor to the design team and has helped to bring them up to speed quickly.",
			"author": "Nicholas Kajok",
			"role": "Staff Engineer, Coolfire Solutions",
			"social": "https://www.linkedin.com/in/nkajok/"
		},
		{
			"content": "Brendan brought strong design skills to our projects together while at Asynchrony. He was able to manage the client relationship and user feedback to build a complete application. Brendan was also quick to jump into technical discussions and gain knowledge and understanding of every aspect of the user experience.",
			"author": "Calvin Cox",
			"role": "Developer, Asynchrony Labs",
			"social": "https://www.linkedin.com/in/calvinkcox/"
		},
		{
			"content": "Brendan is a talented, thoughtful UX and interaction designer. I am convinced he can learn and master any skill or practice to make himself a UX thought and practice lead.",
			"author": "Kate Chadha",
			"role": "Research Practice Lead, Asynchrony Labs",
			"social": "https://www.linkedin.com/in/katechadha/"
		},
		{
			"content": "His designs clearly articulate the value a user will get out of each interaction with the page. Working with Brendan was a treat. In three days of pairing, we were able to redesign the entire application and put forward a working prototype.",
			"author": "Johnny Steenbergen",
			"role": "Developer, Asynchrony Labs",
			"social": "https://www.linkedin.com/in/jwsteenbergen/"
		}
	]
}
